rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#ifndef PPU_REG_H
#define PPU_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                PPU Register               ================ */
/* ===========     Reference: Bee5_PPU_Power_Register_Table_20251023A.xlsx     =========== */
/* ================================================================================ */
#define PPU_PPU_PWPR_VPON_PPU   0x0000
#define PPU_PPU_PMER_VPON_PPU   0x0004
#define PPU_PPU_PWSR_VPON_PPU   0x0008
#define PPU_Reserved_VPON_PPU   0x000C
#define PPU_PPU_DISR_VPON_PPU   0x0010
#define PPU_PPU_MISR_VPON_PPU   0x0014
#define PPU_PPU_STSR_VPON_PPU   0x0018
#define PPU_PPU_UNLK_VPON_PPU   0x001C
#define PPU_PPU_PWCR_VPON_PPU   0x0020
#define PPU_PPU_PTCR_VPON_PPU   0x0024
#define PPU_PPU_IMR_VPON_PPU    0x0030
#define PPU_PPU_AIMR_VPON_PPU   0x0034
#define PPU_PPU_ISR_VPON_PPU    0x0038
#define PPU_PPU_AISR_VPON_PPU   0x003C
#define PPU_PPU_IESR_VPON_PPU   0x0040
#define PPU_PPU_OPSR_VPON_PPU   0x0044
#define PPU_PPU_FUNRR_VPON_PPU  0x0050
#define PPU_PPU_FULRR_VPON_PPU  0x0054
#define PPU_PPU_MEMRR_VPON_PPU  0x0058
#define PPU_PPU_EDTR0_VPON_PPU  0x0160
#define PPU_PPU_EDTR1_VPON_PPU  0x0164
#define PPU_PPU_DCDR0_VPON_PPU  0x0170
#define PPU_PPU_DCDR1_VPON_PPU  0x0174
#define PPU_PPU_IDR0_VPON_PPU   0x0FB0
#define PPU_PPU_IDR1_VPON_PPU   0x0FB4
#define PPU_PPU_IIDR_VPON_PPU   0x0FC8
#define PPU_PPU_AIDR_VPON_PPU   0x0FCC
#define PPU_ID_REG_VPON_PPU_1   0x0FD0
#define PPU_ID_REG_VPON_PPU_2   0x0FD4
#define PPU_ID_REG_VPON_PPU_3   0x0FD8
#define PPU_ID_REG_VPON_PPU_4   0x0FDC
#define PPU_ID_REG_VPON_PPU_5   0x0FE0
#define PPU_ID_REG_VPON_PPU_6   0x0FE4
#define PPU_ID_REG_VPON_PPU_7   0x0FE8
#define PPU_ID_REG_VPON_PPU_8   0x0FEC
#define PPU_ID_REG_VPON_PPU_9   0x0FF0
#define PPU_ID_REG_VPON_PPU_10  0x0FF4
#define PPU_ID_REG_VPON_PPU_11  0x0FF8
#define PPU_ID_REG_VPON_PPU_12  0x0FFC

/* 0x0000   0x4000_2000
    3:0     RW      PWR_POLICY                  DEF_PWR_POLICY
    7:4     RO      RESERVED_4                  0x0
    8       RW      PWR_DYN_EN                  DEF_PWR_DYN_EN
    11:9    RO      RESERVED_3                  0x0
    12      RW      LOCK_EN                     0x0
    15:13   RO      RESERVED_2                  0x0
    19:16   RW      OP_POLICY                   DEF_OP_POLICY
    23:20   RO      RESERVED_1                  0x0
    24      RW      OP_DYN_EN                   DEF_OP_DYN_EN
    31:25   RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_PWPR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PWR_POLICY: 4;
        uint32_t RESERVED_4: 4;
        uint32_t PWR_DYN_EN: 1;
        uint32_t RESERVED_3: 3;
        uint32_t LOCK_EN: 1;
        uint32_t RESERVED_2: 3;
        uint32_t OP_POLICY: 4;
        uint32_t RESERVED_1: 4;
        uint32_t OP_DYN_EN: 1;
        uint32_t RESERVED: 7;
    };
} PPU_PPU_PWPR_VPON_PPU_TYPE;

/*0x4000_2000 PPU_PPU_PWPR_VPON_PPU*/
#define PPU_PPU_PWPR_VPON_PPU_PWR_POLICY_Pos                         0U
#define PPU_PPU_PWPR_VPON_PPU_PWR_POLICY_Msk                         (0xFUL << PPU_PPU_PWPR_VPON_PPU_PWR_POLICY_Pos)

#define PPU_PPU_PWPR_VPON_PPU_RESERVED_4_Pos                         4U
#define PPU_PPU_PWPR_VPON_PPU_RESERVED_4_Msk                         (0xFUL << PPU_PPU_PWPR_VPON_PPU_RESERVED_4_Pos)

#define PPU_PPU_PWPR_VPON_PPU_PWR_DYN_EN_Pos                         8U
#define PPU_PPU_PWPR_VPON_PPU_PWR_DYN_EN_Msk                         (0x1UL << PPU_PPU_PWPR_VPON_PPU_PWR_DYN_EN_Pos)

#define PPU_PPU_PWPR_VPON_PPU_RESERVED_3_Pos                         9U
#define PPU_PPU_PWPR_VPON_PPU_RESERVED_3_Msk                         (0x7UL << PPU_PPU_PWPR_VPON_PPU_RESERVED_3_Pos)

#define PPU_PPU_PWPR_VPON_PPU_LOCK_EN_Pos                            12U
#define PPU_PPU_PWPR_VPON_PPU_LOCK_EN_Msk                            (0x1UL << PPU_PPU_PWPR_VPON_PPU_LOCK_EN_Pos)

#define PPU_PPU_PWPR_VPON_PPU_RESERVED_2_Pos                         13U
#define PPU_PPU_PWPR_VPON_PPU_RESERVED_2_Msk                         (0x7UL << PPU_PPU_PWPR_VPON_PPU_RESERVED_2_Pos)

#define PPU_PPU_PWPR_VPON_PPU_OP_POLICY_Pos                          16U
#define PPU_PPU_PWPR_VPON_PPU_OP_POLICY_Msk                          (0xFUL << PPU_PPU_PWPR_VPON_PPU_OP_POLICY_Pos)

#define PPU_PPU_PWPR_VPON_PPU_RESERVED_1_Pos                         20U
#define PPU_PPU_PWPR_VPON_PPU_RESERVED_1_Msk                         (0xFUL << PPU_PPU_PWPR_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_PWPR_VPON_PPU_OP_DYN_EN_Pos                          24U
#define PPU_PPU_PWPR_VPON_PPU_OP_DYN_EN_Msk                          (0x1UL << PPU_PPU_PWPR_VPON_PPU_OP_DYN_EN_Pos)

#define PPU_PPU_PWPR_VPON_PPU_RESERVED_Pos                           25U
#define PPU_PPU_PWPR_VPON_PPU_RESERVED_Msk                           (0x7FUL << PPU_PPU_PWPR_VPON_PPU_RESERVED_Pos)

/* 0x0004   0x4000_2004
    0       RW      EMU_EN                      0x0
    31:1    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_PMER_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EMU_EN: 1;
        uint32_t RESERVED: 31;
    };
} PPU_PPU_PMER_VPON_PPU_TYPE;

/*0x4000_2004 PPU_PPU_PMER_VPON_PPU*/
#define PPU_PPU_PMER_VPON_PPU_EMU_EN_Pos                             0U
#define PPU_PPU_PMER_VPON_PPU_EMU_EN_Msk                             (0x1UL << PPU_PPU_PMER_VPON_PPU_EMU_EN_Pos)

#define PPU_PPU_PMER_VPON_PPU_RESERVED_Pos                           1U
#define PPU_PPU_PMER_VPON_PPU_RESERVED_Msk                           (0x7FFFFFFFUL << PPU_PPU_PMER_VPON_PPU_RESERVED_Pos)

/* 0x0008   0x4000_2008
    3:0     RO      PWR_STATUS                  PCSMMODESTAT[3:0]
    7:4     RO      RESERVED_4                  0x0
    8       RO      PWR_DYN_STATUS              DEF_PWR_DYN_EN
    11:9    RO      RESERVED_3                  0x0
    12      RO      LOCK_STATUS                 0x0
    15:13   RO      RESERVED_2                  0x0
    19:16   RO      OP_STATUS                   PCSMMODESTAT[7:4]
    23:20   RO      RESERVED_1                  0x0
    24      RO      OP_DYN_STATUS               DEF_OP_DYN_EN
    31:25   RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_PWSR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PWR_STATUS: 4;
        uint32_t RESERVED_4: 4;
        uint32_t PWR_DYN_STATUS: 1;
        uint32_t RESERVED_3: 3;
        uint32_t LOCK_STATUS: 1;
        uint32_t RESERVED_2: 3;
        uint32_t OP_STATUS: 4;
        uint32_t RESERVED_1: 4;
        uint32_t OP_DYN_STATUS: 1;
        uint32_t RESERVED: 7;
    };
} PPU_PPU_PWSR_VPON_PPU_TYPE;

/*0x4000_2008 PPU_PPU_PWSR_VPON_PPU*/
#define PPU_PPU_PWSR_VPON_PPU_PWR_STATUS_Pos                         0U
#define PPU_PPU_PWSR_VPON_PPU_PWR_STATUS_Msk                         (0xFUL << PPU_PPU_PWSR_VPON_PPU_PWR_STATUS_Pos)

#define PPU_PPU_PWSR_VPON_PPU_RESERVED_4_Pos                         4U
#define PPU_PPU_PWSR_VPON_PPU_RESERVED_4_Msk                         (0xFUL << PPU_PPU_PWSR_VPON_PPU_RESERVED_4_Pos)

#define PPU_PPU_PWSR_VPON_PPU_PWR_DYN_STATUS_Pos                     8U
#define PPU_PPU_PWSR_VPON_PPU_PWR_DYN_STATUS_Msk                     (0x1UL << PPU_PPU_PWSR_VPON_PPU_PWR_DYN_STATUS_Pos)

#define PPU_PPU_PWSR_VPON_PPU_RESERVED_3_Pos                         9U
#define PPU_PPU_PWSR_VPON_PPU_RESERVED_3_Msk                         (0x7UL << PPU_PPU_PWSR_VPON_PPU_RESERVED_3_Pos)

#define PPU_PPU_PWSR_VPON_PPU_LOCK_STATUS_Pos                        12U
#define PPU_PPU_PWSR_VPON_PPU_LOCK_STATUS_Msk                        (0x1UL << PPU_PPU_PWSR_VPON_PPU_LOCK_STATUS_Pos)

#define PPU_PPU_PWSR_VPON_PPU_RESERVED_2_Pos                         13U
#define PPU_PPU_PWSR_VPON_PPU_RESERVED_2_Msk                         (0x7UL << PPU_PPU_PWSR_VPON_PPU_RESERVED_2_Pos)

