rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_PWSR_VPON_PPU_OP_STATUS_Pos                          16U
#define PPU_PPU_PWSR_VPON_PPU_OP_STATUS_Msk                          (0xFUL << PPU_PPU_PWSR_VPON_PPU_OP_STATUS_Pos)

#define PPU_PPU_PWSR_VPON_PPU_RESERVED_1_Pos                         20U
#define PPU_PPU_PWSR_VPON_PPU_RESERVED_1_Msk                         (0xFUL << PPU_PPU_PWSR_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_PWSR_VPON_PPU_OP_DYN_STATUS_Pos                      24U
#define PPU_PPU_PWSR_VPON_PPU_OP_DYN_STATUS_Msk                      (0x1UL << PPU_PPU_PWSR_VPON_PPU_OP_DYN_STATUS_Pos)

#define PPU_PPU_PWSR_VPON_PPU_RESERVED_Pos                           25U
#define PPU_PPU_PWSR_VPON_PPU_RESERVED_Msk                           (0x7FUL << PPU_PPU_PWSR_VPON_PPU_RESERVED_Pos)

/* 0x000C   0x4000_200c
    31:0    RO      Reserved                    0x0
 */
typedef union _PPU_Reserved_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t Reserved;
    };
} PPU_Reserved_VPON_PPU_TYPE;

/*0x4000_200c PPU_Reserved_VPON_PPU*/
#define PPU_Reserved_VPON_PPU_Reserved_Pos                           0U
#define PPU_Reserved_VPON_PPU_Reserved_Msk                           (0xFFFFFFFFUL << PPU_Reserved_VPON_PPU_Reserved_Pos)

/* 0x0010   0x4000_2010
    10:0    RO      PWR_DEVACTIVE_STATUS        0x0
    23:11   RO      RESERVED                    0x0
    31:24   RO      OP_DEVACTIVE_STATUS         0x0
 */
typedef union _PPU_PPU_DISR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PWR_DEVACTIVE_STATUS: 11;
        uint32_t RESERVED: 13;
        uint32_t OP_DEVACTIVE_STATUS: 8;
    };
} PPU_PPU_DISR_VPON_PPU_TYPE;

/*0x4000_2010 PPU_PPU_DISR_VPON_PPU*/
#define PPU_PPU_DISR_VPON_PPU_PWR_DEVACTIVE_STATUS_Pos               0U
#define PPU_PPU_DISR_VPON_PPU_PWR_DEVACTIVE_STATUS_Msk               (0x7FFUL << PPU_PPU_DISR_VPON_PPU_PWR_DEVACTIVE_STATUS_Pos)

#define PPU_PPU_DISR_VPON_PPU_RESERVED_Pos                           11U
#define PPU_PPU_DISR_VPON_PPU_RESERVED_Msk                           (0x1FFFUL << PPU_PPU_DISR_VPON_PPU_RESERVED_Pos)

#define PPU_PPU_DISR_VPON_PPU_OP_DEVACTIVE_STATUS_Pos                24U
#define PPU_PPU_DISR_VPON_PPU_OP_DEVACTIVE_STATUS_Msk                (0xFFUL << PPU_PPU_DISR_VPON_PPU_OP_DEVACTIVE_STATUS_Pos)

/* 0x0014   0x4000_2014
    0       RO      PCSMPACCEPT_STATUS          0x0
    7:1     RO      RESERVED_1                  0x0
    15:8    RO      DEVACCEPT_STATUS            0x0
    23:16   RO      DEVDENY_STATUS              0x0
    31:24   RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_MISR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PCSMPACCEPT_STATUS: 1;
        uint32_t RESERVED_1: 7;
        uint32_t DEVACCEPT_STATUS: 8;
        uint32_t DEVDENY_STATUS: 8;
        uint32_t RESERVED: 8;
    };
} PPU_PPU_MISR_VPON_PPU_TYPE;

/*0x4000_2014 PPU_PPU_MISR_VPON_PPU*/
#define PPU_PPU_MISR_VPON_PPU_PCSMPACCEPT_STATUS_Pos                 0U
#define PPU_PPU_MISR_VPON_PPU_PCSMPACCEPT_STATUS_Msk                 (0x1UL << PPU_PPU_MISR_VPON_PPU_PCSMPACCEPT_STATUS_Pos)

#define PPU_PPU_MISR_VPON_PPU_RESERVED_1_Pos                         1U
#define PPU_PPU_MISR_VPON_PPU_RESERVED_1_Msk                         (0x7FUL << PPU_PPU_MISR_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_MISR_VPON_PPU_DEVACCEPT_STATUS_Pos                   8U
#define PPU_PPU_MISR_VPON_PPU_DEVACCEPT_STATUS_Msk                   (0xFFUL << PPU_PPU_MISR_VPON_PPU_DEVACCEPT_STATUS_Pos)

#define PPU_PPU_MISR_VPON_PPU_DEVDENY_STATUS_Pos                     16U
#define PPU_PPU_MISR_VPON_PPU_DEVDENY_STATUS_Msk                     (0xFFUL << PPU_PPU_MISR_VPON_PPU_DEVDENY_STATUS_Pos)

#define PPU_PPU_MISR_VPON_PPU_RESERVED_Pos                           24U
#define PPU_PPU_MISR_VPON_PPU_RESERVED_Msk                           (0xFFUL << PPU_PPU_MISR_VPON_PPU_RESERVED_Pos)

/* 0x0018   0x4000_2018
    7:0     RO      STORED_DEVDENY              0x0
    31:8    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_STSR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t STORED_DEVDENY: 8;
        uint32_t RESERVED: 24;
    };
} PPU_PPU_STSR_VPON_PPU_TYPE;

/*0x4000_2018 PPU_PPU_STSR_VPON_PPU*/
#define PPU_PPU_STSR_VPON_PPU_STORED_DEVDENY_Pos                     0U
#define PPU_PPU_STSR_VPON_PPU_STORED_DEVDENY_Msk                     (0xFFUL << PPU_PPU_STSR_VPON_PPU_STORED_DEVDENY_Pos)

#define PPU_PPU_STSR_VPON_PPU_RESERVED_Pos                           8U
#define PPU_PPU_STSR_VPON_PPU_RESERVED_Msk                           (0xFFFFFFUL << PPU_PPU_STSR_VPON_PPU_RESERVED_Pos)

/* 0x001C   0x4000_201c
    0       WO      UNLOCK                      0x0
    31:1    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_UNLK_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t UNLOCK: 1;
        uint32_t RESERVED: 31;
    };
} PPU_PPU_UNLK_VPON_PPU_TYPE;

/*0x4000_201c PPU_PPU_UNLK_VPON_PPU*/
#define PPU_PPU_UNLK_VPON_PPU_UNLOCK_Pos                             0U
#define PPU_PPU_UNLK_VPON_PPU_UNLOCK_Msk                             (0x1UL << PPU_PPU_UNLK_VPON_PPU_UNLOCK_Pos)

#define PPU_PPU_UNLK_VPON_PPU_RESERVED_Pos                           1U
#define PPU_PPU_UNLK_VPON_PPU_RESERVED_Msk                           (0x7FFFFFFFUL << PPU_PPU_UNLK_VPON_PPU_RESERVED_Pos)

/* 0x0020   0x4000_2020
    7:0     RW      DEVREQEN                    SeeTable
    18:8    RW      PWR_DEVACTIVEEN             SeeTable
    23:19   RO      RESERVED                    0x0
    31:24   RW      OP_DEVACTIVEEN              SeeTable
 */
typedef union _PPU_PPU_PWCR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEVREQEN: 8;
        uint32_t PWR_DEVACTIVEEN: 11;
        uint32_t RESERVED: 5;
        uint32_t OP_DEVACTIVEEN: 8;
    };
} PPU_PPU_PWCR_VPON_PPU_TYPE;

/*0x4000_2020 PPU_PPU_PWCR_VPON_PPU*/
#define PPU_PPU_PWCR_VPON_PPU_DEVREQEN_Pos                           0U
#define PPU_PPU_PWCR_VPON_PPU_DEVREQEN_Msk                           (0xFFUL << PPU_PPU_PWCR_VPON_PPU_DEVREQEN_Pos)

