rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_PWCR_VPON_PPU_PWR_DEVACTIVEEN_Pos                    8U
#define PPU_PPU_PWCR_VPON_PPU_PWR_DEVACTIVEEN_Msk                    (0x7FFUL << PPU_PPU_PWCR_VPON_PPU_PWR_DEVACTIVEEN_Pos)

#define PPU_PPU_PWCR_VPON_PPU_RESERVED_Pos                           19U
#define PPU_PPU_PWCR_VPON_PPU_RESERVED_Msk                           (0x1FUL << PPU_PPU_PWCR_VPON_PPU_RESERVED_Pos)

#define PPU_PPU_PWCR_VPON_PPU_OP_DEVACTIVEEN_Pos                     24U
#define PPU_PPU_PWCR_VPON_PPU_OP_DEVACTIVEEN_Msk                     (0xFFUL << PPU_PPU_PWCR_VPON_PPU_OP_DEVACTIVEEN_Pos)

/* 0x0024   0x4000_2024
    0       RW      WARM_RST_DEVREQEN           WARM_RST_DEVREQEN_CFG
    1       RW      DBG_RECOV_PORST_EN          DBG_RECOV_PORST_CFG
    31:2    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_PTCR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WARM_RST_DEVREQEN: 1;
        uint32_t DBG_RECOV_PORST_EN: 1;
        uint32_t RESERVED: 30;
    };
} PPU_PPU_PTCR_VPON_PPU_TYPE;

/*0x4000_2024 PPU_PPU_PTCR_VPON_PPU*/
#define PPU_PPU_PTCR_VPON_PPU_WARM_RST_DEVREQEN_Pos                  0U
#define PPU_PPU_PTCR_VPON_PPU_WARM_RST_DEVREQEN_Msk                  (0x1UL << PPU_PPU_PTCR_VPON_PPU_WARM_RST_DEVREQEN_Pos)

#define PPU_PPU_PTCR_VPON_PPU_DBG_RECOV_PORST_EN_Pos                 1U
#define PPU_PPU_PTCR_VPON_PPU_DBG_RECOV_PORST_EN_Msk                 (0x1UL << PPU_PPU_PTCR_VPON_PPU_DBG_RECOV_PORST_EN_Pos)

#define PPU_PPU_PTCR_VPON_PPU_RESERVED_Pos                           2U
#define PPU_PPU_PTCR_VPON_PPU_RESERVED_Msk                           (0x3FFFFFFFUL << PPU_PPU_PTCR_VPON_PPU_RESERVED_Pos)

/* 0x0030   0x4000_2030
    0       RW      STA_POLICY_TRN_IRQ_MASK     0x0
    1       RW      STA_ACCEPT_IRQ_MASK         0x1
    2       RW      STA_DENY_IRQ_MASK           0x0
    3       RW      EMU_ACCEPT_IRQ_MASK         0x1
    4       RW      EMU_DENY_IRQ_MASK           0x1
    5       RW      LOCKED_IRQ_MASK             0x1
    31:6    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_IMR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t STA_POLICY_TRN_IRQ_MASK: 1;
        uint32_t STA_ACCEPT_IRQ_MASK: 1;
        uint32_t STA_DENY_IRQ_MASK: 1;
        uint32_t EMU_ACCEPT_IRQ_MASK: 1;
        uint32_t EMU_DENY_IRQ_MASK: 1;
        uint32_t LOCKED_IRQ_MASK: 1;
        uint32_t RESERVED: 26;
    };
} PPU_PPU_IMR_VPON_PPU_TYPE;

/*0x4000_2030 PPU_PPU_IMR_VPON_PPU*/
#define PPU_PPU_IMR_VPON_PPU_STA_POLICY_TRN_IRQ_MASK_Pos             0U
#define PPU_PPU_IMR_VPON_PPU_STA_POLICY_TRN_IRQ_MASK_Msk             (0x1UL << PPU_PPU_IMR_VPON_PPU_STA_POLICY_TRN_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_STA_ACCEPT_IRQ_MASK_Pos                 1U
#define PPU_PPU_IMR_VPON_PPU_STA_ACCEPT_IRQ_MASK_Msk                 (0x1UL << PPU_PPU_IMR_VPON_PPU_STA_ACCEPT_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_STA_DENY_IRQ_MASK_Pos                   2U
#define PPU_PPU_IMR_VPON_PPU_STA_DENY_IRQ_MASK_Msk                   (0x1UL << PPU_PPU_IMR_VPON_PPU_STA_DENY_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_EMU_ACCEPT_IRQ_MASK_Pos                 3U
#define PPU_PPU_IMR_VPON_PPU_EMU_ACCEPT_IRQ_MASK_Msk                 (0x1UL << PPU_PPU_IMR_VPON_PPU_EMU_ACCEPT_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_EMU_DENY_IRQ_MASK_Pos                   4U
#define PPU_PPU_IMR_VPON_PPU_EMU_DENY_IRQ_MASK_Msk                   (0x1UL << PPU_PPU_IMR_VPON_PPU_EMU_DENY_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_LOCKED_IRQ_MASK_Pos                     5U
#define PPU_PPU_IMR_VPON_PPU_LOCKED_IRQ_MASK_Msk                     (0x1UL << PPU_PPU_IMR_VPON_PPU_LOCKED_IRQ_MASK_Pos)

#define PPU_PPU_IMR_VPON_PPU_RESERVED_Pos                            6U
#define PPU_PPU_IMR_VPON_PPU_RESERVED_Msk                            (0x3FFFFFFUL << PPU_PPU_IMR_VPON_PPU_RESERVED_Pos)

/* 0x0034   0x4000_2034
    0       RW      UNSPT_POLICY_IRQ_MASK       0x0
    1       RW      DYN_ACCEPT_IRQ_MASK         0x1
    2       RW      DYN_DENY_IRQ_MASK           0x1
    3       RW      STA_POLICY_PWR_IRQ_MASK     0x1
    4       RW      STA_POLICY_OP_IRQ_MASK      0x1
    31:5    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_AIMR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t UNSPT_POLICY_IRQ_MASK: 1;
        uint32_t DYN_ACCEPT_IRQ_MASK: 1;
        uint32_t DYN_DENY_IRQ_MASK: 1;
        uint32_t STA_POLICY_PWR_IRQ_MASK: 1;
        uint32_t STA_POLICY_OP_IRQ_MASK: 1;
        uint32_t RESERVED: 27;
    };
} PPU_PPU_AIMR_VPON_PPU_TYPE;

/*0x4000_2034 PPU_PPU_AIMR_VPON_PPU*/
#define PPU_PPU_AIMR_VPON_PPU_UNSPT_POLICY_IRQ_MASK_Pos              0U
#define PPU_PPU_AIMR_VPON_PPU_UNSPT_POLICY_IRQ_MASK_Msk              (0x1UL << PPU_PPU_AIMR_VPON_PPU_UNSPT_POLICY_IRQ_MASK_Pos)

#define PPU_PPU_AIMR_VPON_PPU_DYN_ACCEPT_IRQ_MASK_Pos                1U
#define PPU_PPU_AIMR_VPON_PPU_DYN_ACCEPT_IRQ_MASK_Msk                (0x1UL << PPU_PPU_AIMR_VPON_PPU_DYN_ACCEPT_IRQ_MASK_Pos)

#define PPU_PPU_AIMR_VPON_PPU_DYN_DENY_IRQ_MASK_Pos                  2U
#define PPU_PPU_AIMR_VPON_PPU_DYN_DENY_IRQ_MASK_Msk                  (0x1UL << PPU_PPU_AIMR_VPON_PPU_DYN_DENY_IRQ_MASK_Pos)

#define PPU_PPU_AIMR_VPON_PPU_STA_POLICY_PWR_IRQ_MASK_Pos            3U
#define PPU_PPU_AIMR_VPON_PPU_STA_POLICY_PWR_IRQ_MASK_Msk            (0x1UL << PPU_PPU_AIMR_VPON_PPU_STA_POLICY_PWR_IRQ_MASK_Pos)

#define PPU_PPU_AIMR_VPON_PPU_STA_POLICY_OP_IRQ_MASK_Pos             4U
#define PPU_PPU_AIMR_VPON_PPU_STA_POLICY_OP_IRQ_MASK_Msk             (0x1UL << PPU_PPU_AIMR_VPON_PPU_STA_POLICY_OP_IRQ_MASK_Pos)

#define PPU_PPU_AIMR_VPON_PPU_RESERVED_Pos                           5U
#define PPU_PPU_AIMR_VPON_PPU_RESERVED_Msk                           (0x7FFFFFFUL << PPU_PPU_AIMR_VPON_PPU_RESERVED_Pos)

/* 0x0038   0x4000_2038
    0       RW      STA_POLICY_TRN_IRQ          0x0
    1       RW      STA_ACCEPT_IRQ              0x0
    2       RW      STA_DENY_IRQ                0x0
    3       RW      EMU_ACCEPT_IRQ              0x0
    4       RW      EMU_DENY_IRQ                0x0
    5       RW      LOCKED_IRQ                  0x0
    6       RW      RESERVED_1                  0x0
    7       RO      OTHER_IRQ                   0x0
    18:8    RW      PWR_ACTIVE_EDGE_IRQ         0x00
    23:19   RO      RESERVED                    0x0
    31:24   RW      OP_ACTIVE_EDGE_IRQ          0x0
 */
typedef union _PPU_PPU_ISR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t STA_POLICY_TRN_IRQ: 1;
        uint32_t STA_ACCEPT_IRQ: 1;
        uint32_t STA_DENY_IRQ: 1;
        uint32_t EMU_ACCEPT_IRQ: 1;
        uint32_t EMU_DENY_IRQ: 1;
        uint32_t LOCKED_IRQ: 1;
        uint32_t RESERVED_1: 1;
        uint32_t OTHER_IRQ: 1;
        uint32_t PWR_ACTIVE_EDGE_IRQ: 11;
        uint32_t RESERVED: 5;
        uint32_t OP_ACTIVE_EDGE_IRQ: 8;
    };
} PPU_PPU_ISR_VPON_PPU_TYPE;

/*0x4000_2038 PPU_PPU_ISR_VPON_PPU*/
#define PPU_PPU_ISR_VPON_PPU_STA_POLICY_TRN_IRQ_Pos                  0U
#define PPU_PPU_ISR_VPON_PPU_STA_POLICY_TRN_IRQ_Msk                  (0x1UL << PPU_PPU_ISR_VPON_PPU_STA_POLICY_TRN_IRQ_Pos)

