rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_ISR_VPON_PPU_STA_ACCEPT_IRQ_Pos                      1U
#define PPU_PPU_ISR_VPON_PPU_STA_ACCEPT_IRQ_Msk                      (0x1UL << PPU_PPU_ISR_VPON_PPU_STA_ACCEPT_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_STA_DENY_IRQ_Pos                        2U
#define PPU_PPU_ISR_VPON_PPU_STA_DENY_IRQ_Msk                        (0x1UL << PPU_PPU_ISR_VPON_PPU_STA_DENY_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_EMU_ACCEPT_IRQ_Pos                      3U
#define PPU_PPU_ISR_VPON_PPU_EMU_ACCEPT_IRQ_Msk                      (0x1UL << PPU_PPU_ISR_VPON_PPU_EMU_ACCEPT_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_EMU_DENY_IRQ_Pos                        4U
#define PPU_PPU_ISR_VPON_PPU_EMU_DENY_IRQ_Msk                        (0x1UL << PPU_PPU_ISR_VPON_PPU_EMU_DENY_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_LOCKED_IRQ_Pos                          5U
#define PPU_PPU_ISR_VPON_PPU_LOCKED_IRQ_Msk                          (0x1UL << PPU_PPU_ISR_VPON_PPU_LOCKED_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_RESERVED_1_Pos                          6U
#define PPU_PPU_ISR_VPON_PPU_RESERVED_1_Msk                          (0x1UL << PPU_PPU_ISR_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_ISR_VPON_PPU_OTHER_IRQ_Pos                           7U
#define PPU_PPU_ISR_VPON_PPU_OTHER_IRQ_Msk                           (0x1UL << PPU_PPU_ISR_VPON_PPU_OTHER_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_PWR_ACTIVE_EDGE_IRQ_Pos                 8U
#define PPU_PPU_ISR_VPON_PPU_PWR_ACTIVE_EDGE_IRQ_Msk                 (0x7FFUL << PPU_PPU_ISR_VPON_PPU_PWR_ACTIVE_EDGE_IRQ_Pos)

#define PPU_PPU_ISR_VPON_PPU_RESERVED_Pos                            19U
#define PPU_PPU_ISR_VPON_PPU_RESERVED_Msk                            (0x1FUL << PPU_PPU_ISR_VPON_PPU_RESERVED_Pos)

#define PPU_PPU_ISR_VPON_PPU_OP_ACTIVE_EDGE_IRQ_Pos                  24U
#define PPU_PPU_ISR_VPON_PPU_OP_ACTIVE_EDGE_IRQ_Msk                  (0xFFUL << PPU_PPU_ISR_VPON_PPU_OP_ACTIVE_EDGE_IRQ_Pos)

/* 0x003C   0x4000_203c
    0       RW      UNSPT_POLICY_IRQ            0x0
    1       RW      DYN_ACCEPT_IRQ              0x0
    2       RW      DYN_DENY_IRQ                0x0
    3       RW      STA_POLICY_PWR_IRQ          0x0
    4       RW      STA_POLICY_OP_IRQ           0x0
    31:5    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_AISR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t UNSPT_POLICY_IRQ: 1;
        uint32_t DYN_ACCEPT_IRQ: 1;
        uint32_t DYN_DENY_IRQ: 1;
        uint32_t STA_POLICY_PWR_IRQ: 1;
        uint32_t STA_POLICY_OP_IRQ: 1;
        uint32_t RESERVED: 27;
    };
} PPU_PPU_AISR_VPON_PPU_TYPE;

/*0x4000_203c PPU_PPU_AISR_VPON_PPU*/
#define PPU_PPU_AISR_VPON_PPU_UNSPT_POLICY_IRQ_Pos                   0U
#define PPU_PPU_AISR_VPON_PPU_UNSPT_POLICY_IRQ_Msk                   (0x1UL << PPU_PPU_AISR_VPON_PPU_UNSPT_POLICY_IRQ_Pos)

#define PPU_PPU_AISR_VPON_PPU_DYN_ACCEPT_IRQ_Pos                     1U
#define PPU_PPU_AISR_VPON_PPU_DYN_ACCEPT_IRQ_Msk                     (0x1UL << PPU_PPU_AISR_VPON_PPU_DYN_ACCEPT_IRQ_Pos)

#define PPU_PPU_AISR_VPON_PPU_DYN_DENY_IRQ_Pos                       2U
#define PPU_PPU_AISR_VPON_PPU_DYN_DENY_IRQ_Msk                       (0x1UL << PPU_PPU_AISR_VPON_PPU_DYN_DENY_IRQ_Pos)

#define PPU_PPU_AISR_VPON_PPU_STA_POLICY_PWR_IRQ_Pos                 3U
#define PPU_PPU_AISR_VPON_PPU_STA_POLICY_PWR_IRQ_Msk                 (0x1UL << PPU_PPU_AISR_VPON_PPU_STA_POLICY_PWR_IRQ_Pos)

#define PPU_PPU_AISR_VPON_PPU_STA_POLICY_OP_IRQ_Pos                  4U
#define PPU_PPU_AISR_VPON_PPU_STA_POLICY_OP_IRQ_Msk                  (0x1UL << PPU_PPU_AISR_VPON_PPU_STA_POLICY_OP_IRQ_Pos)

#define PPU_PPU_AISR_VPON_PPU_RESERVED_Pos                           5U
#define PPU_PPU_AISR_VPON_PPU_RESERVED_Msk                           (0x7FFFFFFUL << PPU_PPU_AISR_VPON_PPU_RESERVED_Pos)

/* 0x0040   0x4000_2040
    1:0     RW      DEVACTIVE00_EDGE            0x0
    3:2     RW      DEVACTIVE01_EDGE            0x0
    5:4     RW      DEVACTIVE02_EDGE            0x0
    7:6     RW      DEVACTIVE03_EDGE            0x0
    9:8     RW      DEVACTIVE04_EDGE            0x0
    11:10   RW      DEVACTIVE05_EDGE            0x0
    13:12   RW      DEVACTIVE06_EDGE            0x0
    15:14   RW      DEVACTIVE07_EDGE            0x0
    17:16   RW      DEVACTIVE08_EDGE            0x0
    19:18   RW      DEVACTIVE09_EDGE            0x0
    21:20   RW      DEVACTIVE10_EDGE            0x0
    31:22   RO      RESERVED                    0x0000
 */
typedef union _PPU_PPU_IESR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEVACTIVE00_EDGE: 2;
        uint32_t DEVACTIVE01_EDGE: 2;
        uint32_t DEVACTIVE02_EDGE: 2;
        uint32_t DEVACTIVE03_EDGE: 2;
        uint32_t DEVACTIVE04_EDGE: 2;
        uint32_t DEVACTIVE05_EDGE: 2;
        uint32_t DEVACTIVE06_EDGE: 2;
        uint32_t DEVACTIVE07_EDGE: 2;
        uint32_t DEVACTIVE08_EDGE: 2;
        uint32_t DEVACTIVE09_EDGE: 2;
        uint32_t DEVACTIVE10_EDGE: 2;
        uint32_t RESERVED: 10;
    };
} PPU_PPU_IESR_VPON_PPU_TYPE;

/*0x4000_2040 PPU_PPU_IESR_VPON_PPU*/
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE00_EDGE_Pos                   0U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE00_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE00_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE01_EDGE_Pos                   2U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE01_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE01_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE02_EDGE_Pos                   4U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE02_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE02_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE03_EDGE_Pos                   6U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE03_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE03_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE04_EDGE_Pos                   8U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE04_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE04_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE05_EDGE_Pos                   10U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE05_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE05_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE06_EDGE_Pos                   12U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE06_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE06_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE07_EDGE_Pos                   14U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE07_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE07_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE08_EDGE_Pos                   16U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE08_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE08_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE09_EDGE_Pos                   18U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE09_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE09_EDGE_Pos)

#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE10_EDGE_Pos                   20U
#define PPU_PPU_IESR_VPON_PPU_DEVACTIVE10_EDGE_Msk                   (0x3UL << PPU_PPU_IESR_VPON_PPU_DEVACTIVE10_EDGE_Pos)

