rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_IESR_VPON_PPU_RESERVED_Pos                           22U
#define PPU_PPU_IESR_VPON_PPU_RESERVED_Msk                           (0x3FFUL << PPU_PPU_IESR_VPON_PPU_RESERVED_Pos)

/* 0x0044   0x4000_2044
    1:0     RW      DEVACTIVE16_EDGE            0x0
    3:2     RW      DEVACTIVE17_EDGE            0x0
    5:4     RW      DEVACTIVE18_EDGE            0x0
    7:6     RW      DEVACTIVE19_EDGE            0x0
    9:8     RW      DEVACTIVE20_EDGE            0x0
    11:10   RW      DEVACTIVE21_EDGE            0x0
    13:12   RW      DEVACTIVE22_EDGE            0x0
    15:14   RW      DEVACTIVE23_EDGE            0x0
    31:16   RO      RESERVED                    0x0000
 */
typedef union _PPU_PPU_OPSR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEVACTIVE16_EDGE: 2;
        uint32_t DEVACTIVE17_EDGE: 2;
        uint32_t DEVACTIVE18_EDGE: 2;
        uint32_t DEVACTIVE19_EDGE: 2;
        uint32_t DEVACTIVE20_EDGE: 2;
        uint32_t DEVACTIVE21_EDGE: 2;
        uint32_t DEVACTIVE22_EDGE: 2;
        uint32_t DEVACTIVE23_EDGE: 2;
        uint32_t RESERVED: 16;
    };
} PPU_PPU_OPSR_VPON_PPU_TYPE;

/*0x4000_2044 PPU_PPU_OPSR_VPON_PPU*/
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE16_EDGE_Pos                   0U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE16_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE16_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE17_EDGE_Pos                   2U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE17_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE17_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE18_EDGE_Pos                   4U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE18_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE18_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE19_EDGE_Pos                   6U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE19_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE19_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE20_EDGE_Pos                   8U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE20_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE20_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE21_EDGE_Pos                   10U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE21_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE21_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE22_EDGE_Pos                   12U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE22_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE22_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE23_EDGE_Pos                   14U
#define PPU_PPU_OPSR_VPON_PPU_DEVACTIVE23_EDGE_Msk                   (0x3UL << PPU_PPU_OPSR_VPON_PPU_DEVACTIVE23_EDGE_Pos)

#define PPU_PPU_OPSR_VPON_PPU_RESERVED_Pos                           16U
#define PPU_PPU_OPSR_VPON_PPU_RESERVED_Msk                           (0xFFFFUL << PPU_PPU_OPSR_VPON_PPU_RESERVED_Pos)

/* 0x0050   0x4000_2050
    7:0     RW      FUNC_RET_RAM_CFG            0x0
    31:8    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_FUNRR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FUNC_RET_RAM_CFG: 8;
        uint32_t RESERVED: 24;
    };
} PPU_PPU_FUNRR_VPON_PPU_TYPE;

/*0x4000_2050 PPU_PPU_FUNRR_VPON_PPU*/
#define PPU_PPU_FUNRR_VPON_PPU_FUNC_RET_RAM_CFG_Pos                  0U
#define PPU_PPU_FUNRR_VPON_PPU_FUNC_RET_RAM_CFG_Msk                  (0xFFUL << PPU_PPU_FUNRR_VPON_PPU_FUNC_RET_RAM_CFG_Pos)

#define PPU_PPU_FUNRR_VPON_PPU_RESERVED_Pos                          8U
#define PPU_PPU_FUNRR_VPON_PPU_RESERVED_Msk                          (0xFFFFFFUL << PPU_PPU_FUNRR_VPON_PPU_RESERVED_Pos)

/* 0x0054   0x4000_2054
    7:0     RW      FULL_RET_RAM_CFG            0x0
    31:8    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_FULRR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FULL_RET_RAM_CFG: 8;
        uint32_t RESERVED: 24;
    };
} PPU_PPU_FULRR_VPON_PPU_TYPE;

/*0x4000_2054 PPU_PPU_FULRR_VPON_PPU*/
#define PPU_PPU_FULRR_VPON_PPU_FULL_RET_RAM_CFG_Pos                  0U
#define PPU_PPU_FULRR_VPON_PPU_FULL_RET_RAM_CFG_Msk                  (0xFFUL << PPU_PPU_FULRR_VPON_PPU_FULL_RET_RAM_CFG_Pos)

#define PPU_PPU_FULRR_VPON_PPU_RESERVED_Pos                          8U
#define PPU_PPU_FULRR_VPON_PPU_RESERVED_Msk                          (0xFFFFFFUL << PPU_PPU_FULRR_VPON_PPU_RESERVED_Pos)

/* 0x0058   0x4000_2058
    7:0     RW      MEM_RET_RAM_CFG             0x0
    31:8    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_MEMRR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MEM_RET_RAM_CFG: 8;
        uint32_t RESERVED: 24;
    };
} PPU_PPU_MEMRR_VPON_PPU_TYPE;

/*0x4000_2058 PPU_PPU_MEMRR_VPON_PPU*/
#define PPU_PPU_MEMRR_VPON_PPU_MEM_RET_RAM_CFG_Pos                   0U
#define PPU_PPU_MEMRR_VPON_PPU_MEM_RET_RAM_CFG_Msk                   (0xFFUL << PPU_PPU_MEMRR_VPON_PPU_MEM_RET_RAM_CFG_Pos)

#define PPU_PPU_MEMRR_VPON_PPU_RESERVED_Pos                          8U
#define PPU_PPU_MEMRR_VPON_PPU_RESERVED_Msk                          (0xFFFFFFUL << PPU_PPU_MEMRR_VPON_PPU_RESERVED_Pos)

/* 0x0160   0x4000_2160
    7:0     RW      OFF_DEL                     0x00
    15:8    RW      MEM_RET_DEL                 0x00
    23:16   RW      LOGIC_RET_DEL               0x00
    31:24   RW      FULL_RET_DEL                0x00
 */
typedef union _PPU_PPU_EDTR0_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OFF_DEL: 8;
        uint32_t MEM_RET_DEL: 8;
        uint32_t LOGIC_RET_DEL: 8;
        uint32_t FULL_RET_DEL: 8;
    };
} PPU_PPU_EDTR0_VPON_PPU_TYPE;

/*0x4000_2160 PPU_PPU_EDTR0_VPON_PPU*/
#define PPU_PPU_EDTR0_VPON_PPU_OFF_DEL_Pos                           0U
#define PPU_PPU_EDTR0_VPON_PPU_OFF_DEL_Msk                           (0xFFUL << PPU_PPU_EDTR0_VPON_PPU_OFF_DEL_Pos)

#define PPU_PPU_EDTR0_VPON_PPU_MEM_RET_DEL_Pos                       8U
#define PPU_PPU_EDTR0_VPON_PPU_MEM_RET_DEL_Msk                       (0xFFUL << PPU_PPU_EDTR0_VPON_PPU_MEM_RET_DEL_Pos)

