rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_EDTR0_VPON_PPU_LOGIC_RET_DEL_Pos                     16U
#define PPU_PPU_EDTR0_VPON_PPU_LOGIC_RET_DEL_Msk                     (0xFFUL << PPU_PPU_EDTR0_VPON_PPU_LOGIC_RET_DEL_Pos)

#define PPU_PPU_EDTR0_VPON_PPU_FULL_RET_DEL_Pos                      24U
#define PPU_PPU_EDTR0_VPON_PPU_FULL_RET_DEL_Msk                      (0xFFUL << PPU_PPU_EDTR0_VPON_PPU_FULL_RET_DEL_Pos)

/* 0x0164   0x4000_2164
    7:0     RW      MEM_OFF_DEL                 0x00
    15:8    RW      FUNC_RET_DEL                0x00
    31:16   RO      RESERVED                    0x00
 */
typedef union _PPU_PPU_EDTR1_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MEM_OFF_DEL: 8;
        uint32_t FUNC_RET_DEL: 8;
        uint32_t RESERVED: 16;
    };
} PPU_PPU_EDTR1_VPON_PPU_TYPE;

/*0x4000_2164 PPU_PPU_EDTR1_VPON_PPU*/
#define PPU_PPU_EDTR1_VPON_PPU_MEM_OFF_DEL_Pos                       0U
#define PPU_PPU_EDTR1_VPON_PPU_MEM_OFF_DEL_Msk                       (0xFFUL << PPU_PPU_EDTR1_VPON_PPU_MEM_OFF_DEL_Pos)

#define PPU_PPU_EDTR1_VPON_PPU_FUNC_RET_DEL_Pos                      8U
#define PPU_PPU_EDTR1_VPON_PPU_FUNC_RET_DEL_Msk                      (0xFFUL << PPU_PPU_EDTR1_VPON_PPU_FUNC_RET_DEL_Pos)

#define PPU_PPU_EDTR1_VPON_PPU_RESERVED_Pos                          16U
#define PPU_PPU_EDTR1_VPON_PPU_RESERVED_Msk                          (0xFFFFUL << PPU_PPU_EDTR1_VPON_PPU_RESERVED_Pos)

/* 0x0170   0x4000_2170
    7:0     RW      CLKEN_RST_DLY               CLKEN_RST_DLY_CFG
    15:8    RW      ISO_CLKEN_DLY               ISO_CLKEN_DLY_CFG
    23:16   RW      RST_HWSTAT_DLY              RST_HWSTAT_DLY_CFG
    31:24   RO      RESERVED                    0x000
 */
typedef union _PPU_PPU_DCDR0_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CLKEN_RST_DLY: 8;
        uint32_t ISO_CLKEN_DLY: 8;
        uint32_t RST_HWSTAT_DLY: 8;
        uint32_t RESERVED: 8;
    };
} PPU_PPU_DCDR0_VPON_PPU_TYPE;

/*0x4000_2170 PPU_PPU_DCDR0_VPON_PPU*/
#define PPU_PPU_DCDR0_VPON_PPU_CLKEN_RST_DLY_Pos                     0U
#define PPU_PPU_DCDR0_VPON_PPU_CLKEN_RST_DLY_Msk                     (0xFFUL << PPU_PPU_DCDR0_VPON_PPU_CLKEN_RST_DLY_Pos)

#define PPU_PPU_DCDR0_VPON_PPU_ISO_CLKEN_DLY_Pos                     8U
#define PPU_PPU_DCDR0_VPON_PPU_ISO_CLKEN_DLY_Msk                     (0xFFUL << PPU_PPU_DCDR0_VPON_PPU_ISO_CLKEN_DLY_Pos)

#define PPU_PPU_DCDR0_VPON_PPU_RST_HWSTAT_DLY_Pos                    16U
#define PPU_PPU_DCDR0_VPON_PPU_RST_HWSTAT_DLY_Msk                    (0xFFUL << PPU_PPU_DCDR0_VPON_PPU_RST_HWSTAT_DLY_Pos)

#define PPU_PPU_DCDR0_VPON_PPU_RESERVED_Pos                          24U
#define PPU_PPU_DCDR0_VPON_PPU_RESERVED_Msk                          (0xFFUL << PPU_PPU_DCDR0_VPON_PPU_RESERVED_Pos)

/* 0x0174   0x4000_2174
    7:0     RW      ISO_RST_DLY                 ISO_RST_DLY_CFG
    15:8    RW      CLKEN_ISO_DLY               CLKEN_ISO_DLY_CFG
    31:16   RO      RESERVED                    0x0000
 */
typedef union _PPU_PPU_DCDR1_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ISO_RST_DLY: 8;
        uint32_t CLKEN_ISO_DLY: 8;
        uint32_t RESERVED: 16;
    };
} PPU_PPU_DCDR1_VPON_PPU_TYPE;

/*0x4000_2174 PPU_PPU_DCDR1_VPON_PPU*/
#define PPU_PPU_DCDR1_VPON_PPU_ISO_RST_DLY_Pos                       0U
#define PPU_PPU_DCDR1_VPON_PPU_ISO_RST_DLY_Msk                       (0xFFUL << PPU_PPU_DCDR1_VPON_PPU_ISO_RST_DLY_Pos)

#define PPU_PPU_DCDR1_VPON_PPU_CLKEN_ISO_DLY_Pos                     8U
#define PPU_PPU_DCDR1_VPON_PPU_CLKEN_ISO_DLY_Msk                     (0xFFUL << PPU_PPU_DCDR1_VPON_PPU_CLKEN_ISO_DLY_Pos)

#define PPU_PPU_DCDR1_VPON_PPU_RESERVED_Pos                          16U
#define PPU_PPU_DCDR1_VPON_PPU_RESERVED_Msk                          (0xFFFFUL << PPU_PPU_DCDR1_VPON_PPU_RESERVED_Pos)

/* 0x0FB0   0x4000_2fb0
    3:0     RO      DEVCHAN                     DEVCHAN_CFG
    7:4     RO      NUM_OPMODE                  NUM_OPMODE_CFG
    8       RO      STA_OFF_SPT                 0x1
    9       RO      STA_OFF_EMU_SPT             STA_OFF_EMU_SPT_CFG
    10      RO      STA_MEM_RET_SPT             STA_MEM_RET_SPT_CFG
    11      RO      STA_MEM_RET_EMU_SPT         STA_MEM_RET_EMU_SPT_CFG
    12      RO      STA_LGC_RET_SPT             STA_LGC_RET_SPT_CFG
    13      RO      STA_MEM_OFF_SPT             STA_MEM_OFF_SPT_CFG
    14      RO      STA_FULL_RET_SPT            STA_FULL_RET_SPT_CFG
    15      RO      STA_FUNC_RET_SPT            STA_FUNC_RET_SPT_CFG
    16      RO      STA_ON_SPT                  0x1
    17      RO      STA_WRM_RST_SPT             0x1
    18      RO      STA_DBG_RECOV_SPT           STA_DBG_RECOV_SPT_CFG
    19      RO      RESERVED_1                  0X0
    20      RO      DYN_OFF_SPT                 DYN_OFF_SPT_CFG
    21      RO      DYN_OFF_EMU_SPT             DYN_OFF_EMU_SPT_CFG
    22      RO      DYN_MEM_RET_SPT             DYN_MEM_RET_SPT_CFG
    23      RO      DYN_MEM_RET_EMU_SPT         DYN_MEM_RET_EMU_SPT_CFG
    24      RO      DYN_LGC_RET_SPT             DYN_LGC_RET_SPT_CFG
    25      RO      DYN_MEM_OFF_SPT             DYN_MEM_OFF_SPT_CFG
    26      RO      DYN_FULL_RET_SPT            DYN_FULL_RET_SPT_CFG
    27      RO      DYN_FUNC_RET_SPT            DYN_FUNC_RET_SPT_CFG
    28      RO      DYN_ON_SPT                  DYN_ON_SPT_CFG
    29      RO      DYN_WRM_RST_SPT             DYN_WRM_RST_SPT_CFG
    31:30   RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_IDR0_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEVCHAN: 4;
        uint32_t NUM_OPMODE: 4;
        uint32_t STA_OFF_SPT: 1;
        uint32_t STA_OFF_EMU_SPT: 1;
        uint32_t STA_MEM_RET_SPT: 1;
        uint32_t STA_MEM_RET_EMU_SPT: 1;
        uint32_t STA_LGC_RET_SPT: 1;
        uint32_t STA_MEM_OFF_SPT: 1;
        uint32_t STA_FULL_RET_SPT: 1;
        uint32_t STA_FUNC_RET_SPT: 1;
        uint32_t STA_ON_SPT: 1;
        uint32_t STA_WRM_RST_SPT: 1;
        uint32_t STA_DBG_RECOV_SPT: 1;
        uint32_t RESERVED_1: 1;
        uint32_t DYN_OFF_SPT: 1;
        uint32_t DYN_OFF_EMU_SPT: 1;
        uint32_t DYN_MEM_RET_SPT: 1;
        uint32_t DYN_MEM_RET_EMU_SPT: 1;
        uint32_t DYN_LGC_RET_SPT: 1;
        uint32_t DYN_MEM_OFF_SPT: 1;
        uint32_t DYN_FULL_RET_SPT: 1;
        uint32_t DYN_FUNC_RET_SPT: 1;
        uint32_t DYN_ON_SPT: 1;
        uint32_t DYN_WRM_RST_SPT: 1;
        uint32_t RESERVED: 2;
    };
} PPU_PPU_IDR0_VPON_PPU_TYPE;

/*0x4000_2fb0 PPU_PPU_IDR0_VPON_PPU*/
#define PPU_PPU_IDR0_VPON_PPU_DEVCHAN_Pos                            0U
#define PPU_PPU_IDR0_VPON_PPU_DEVCHAN_Msk                            (0xFUL << PPU_PPU_IDR0_VPON_PPU_DEVCHAN_Pos)

#define PPU_PPU_IDR0_VPON_PPU_NUM_OPMODE_Pos                         4U
#define PPU_PPU_IDR0_VPON_PPU_NUM_OPMODE_Msk                         (0xFUL << PPU_PPU_IDR0_VPON_PPU_NUM_OPMODE_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_OFF_SPT_Pos                        8U
#define PPU_PPU_IDR0_VPON_PPU_STA_OFF_SPT_Msk                        (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_OFF_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_OFF_EMU_SPT_Pos                    9U
#define PPU_PPU_IDR0_VPON_PPU_STA_OFF_EMU_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_OFF_EMU_SPT_Pos)

