rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_SPT_Pos                    10U
#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_EMU_SPT_Pos                11U
#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_EMU_SPT_Msk                (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_MEM_RET_EMU_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_LGC_RET_SPT_Pos                    12U
#define PPU_PPU_IDR0_VPON_PPU_STA_LGC_RET_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_LGC_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_OFF_SPT_Pos                    13U
#define PPU_PPU_IDR0_VPON_PPU_STA_MEM_OFF_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_MEM_OFF_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_FULL_RET_SPT_Pos                   14U
#define PPU_PPU_IDR0_VPON_PPU_STA_FULL_RET_SPT_Msk                   (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_FULL_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_FUNC_RET_SPT_Pos                   15U
#define PPU_PPU_IDR0_VPON_PPU_STA_FUNC_RET_SPT_Msk                   (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_FUNC_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_ON_SPT_Pos                         16U
#define PPU_PPU_IDR0_VPON_PPU_STA_ON_SPT_Msk                         (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_ON_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_WRM_RST_SPT_Pos                    17U
#define PPU_PPU_IDR0_VPON_PPU_STA_WRM_RST_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_WRM_RST_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_STA_DBG_RECOV_SPT_Pos                  18U
#define PPU_PPU_IDR0_VPON_PPU_STA_DBG_RECOV_SPT_Msk                  (0x1UL << PPU_PPU_IDR0_VPON_PPU_STA_DBG_RECOV_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_RESERVED_1_Pos                         19U
#define PPU_PPU_IDR0_VPON_PPU_RESERVED_1_Msk                         (0x1UL << PPU_PPU_IDR0_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_OFF_SPT_Pos                        20U
#define PPU_PPU_IDR0_VPON_PPU_DYN_OFF_SPT_Msk                        (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_OFF_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_OFF_EMU_SPT_Pos                    21U
#define PPU_PPU_IDR0_VPON_PPU_DYN_OFF_EMU_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_OFF_EMU_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_SPT_Pos                    22U
#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_EMU_SPT_Pos                23U
#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_EMU_SPT_Msk                (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_MEM_RET_EMU_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_LGC_RET_SPT_Pos                    24U
#define PPU_PPU_IDR0_VPON_PPU_DYN_LGC_RET_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_LGC_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_OFF_SPT_Pos                    25U
#define PPU_PPU_IDR0_VPON_PPU_DYN_MEM_OFF_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_MEM_OFF_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_FULL_RET_SPT_Pos                   26U
#define PPU_PPU_IDR0_VPON_PPU_DYN_FULL_RET_SPT_Msk                   (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_FULL_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_FUNC_RET_SPT_Pos                   27U
#define PPU_PPU_IDR0_VPON_PPU_DYN_FUNC_RET_SPT_Msk                   (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_FUNC_RET_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_ON_SPT_Pos                         28U
#define PPU_PPU_IDR0_VPON_PPU_DYN_ON_SPT_Msk                         (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_ON_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_DYN_WRM_RST_SPT_Pos                    29U
#define PPU_PPU_IDR0_VPON_PPU_DYN_WRM_RST_SPT_Msk                    (0x1UL << PPU_PPU_IDR0_VPON_PPU_DYN_WRM_RST_SPT_Pos)

#define PPU_PPU_IDR0_VPON_PPU_RESERVED_Pos                           30U
#define PPU_PPU_IDR0_VPON_PPU_RESERVED_Msk                           (0x3UL << PPU_PPU_IDR0_VPON_PPU_RESERVED_Pos)

/* 0x0FB4   0x4000_2fb4
    0       RO      PWR_MODE_ENTRY_DEL_SPT      PWR_MODE_ENTRY_DEL_CFG
    1       RO      SW_DEV_DEL_SPT              SW_DEV_DEL_CFG
    2       RO      LOCK_SPT                    LOCK_CFG
    3       RO      RESERVED_3                  0x0
    4       RO      MEM_RET_RAM_REG             MEM_RET_RAM_REG_CFG
    5       RO      FULL_RET_RAM_REG            FULL_RET_RAM_REG_CFG
    6       RO      FUNC_RET_RAM_REG            FUNC_RET_RAM_REG_CFG
    7       RO      RESERVED_2                  0x0
    8       RO      STA_POLICY_PWR_IRQ_SPT      STA_POLICY_PWR_IRQ_CFG
    9       RO      STA_POLICY_OP_IRQ_SPT       STA_POLICY_OP_IRQ_CFG
    10      RO      OP_ACTIVE                   OP_ACTIVE_CFG
    11      RO      RESERVED_1                  0x0
    12      RO      OFF_MEM_RET_TRANS           OFF_MEM_RET_TRANS_CFG
    31:13   RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_IDR1_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PWR_MODE_ENTRY_DEL_SPT: 1;
        uint32_t SW_DEV_DEL_SPT: 1;
        uint32_t LOCK_SPT: 1;
        uint32_t RESERVED_3: 1;
        uint32_t MEM_RET_RAM_REG: 1;
        uint32_t FULL_RET_RAM_REG: 1;
        uint32_t FUNC_RET_RAM_REG: 1;
        uint32_t RESERVED_2: 1;
        uint32_t STA_POLICY_PWR_IRQ_SPT: 1;
        uint32_t STA_POLICY_OP_IRQ_SPT: 1;
        uint32_t OP_ACTIVE: 1;
        uint32_t RESERVED_1: 1;
        uint32_t OFF_MEM_RET_TRANS: 1;
        uint32_t RESERVED: 19;
    };
} PPU_PPU_IDR1_VPON_PPU_TYPE;

/*0x4000_2fb4 PPU_PPU_IDR1_VPON_PPU*/
#define PPU_PPU_IDR1_VPON_PPU_PWR_MODE_ENTRY_DEL_SPT_Pos             0U
#define PPU_PPU_IDR1_VPON_PPU_PWR_MODE_ENTRY_DEL_SPT_Msk             (0x1UL << PPU_PPU_IDR1_VPON_PPU_PWR_MODE_ENTRY_DEL_SPT_Pos)

#define PPU_PPU_IDR1_VPON_PPU_SW_DEV_DEL_SPT_Pos                     1U
#define PPU_PPU_IDR1_VPON_PPU_SW_DEV_DEL_SPT_Msk                     (0x1UL << PPU_PPU_IDR1_VPON_PPU_SW_DEV_DEL_SPT_Pos)

#define PPU_PPU_IDR1_VPON_PPU_LOCK_SPT_Pos                           2U
#define PPU_PPU_IDR1_VPON_PPU_LOCK_SPT_Msk                           (0x1UL << PPU_PPU_IDR1_VPON_PPU_LOCK_SPT_Pos)

