rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
#define PPU_PPU_IDR1_VPON_PPU_RESERVED_3_Pos                         3U
#define PPU_PPU_IDR1_VPON_PPU_RESERVED_3_Msk                         (0x1UL << PPU_PPU_IDR1_VPON_PPU_RESERVED_3_Pos)

#define PPU_PPU_IDR1_VPON_PPU_MEM_RET_RAM_REG_Pos                    4U
#define PPU_PPU_IDR1_VPON_PPU_MEM_RET_RAM_REG_Msk                    (0x1UL << PPU_PPU_IDR1_VPON_PPU_MEM_RET_RAM_REG_Pos)

#define PPU_PPU_IDR1_VPON_PPU_FULL_RET_RAM_REG_Pos                   5U
#define PPU_PPU_IDR1_VPON_PPU_FULL_RET_RAM_REG_Msk                   (0x1UL << PPU_PPU_IDR1_VPON_PPU_FULL_RET_RAM_REG_Pos)

#define PPU_PPU_IDR1_VPON_PPU_FUNC_RET_RAM_REG_Pos                   6U
#define PPU_PPU_IDR1_VPON_PPU_FUNC_RET_RAM_REG_Msk                   (0x1UL << PPU_PPU_IDR1_VPON_PPU_FUNC_RET_RAM_REG_Pos)

#define PPU_PPU_IDR1_VPON_PPU_RESERVED_2_Pos                         7U
#define PPU_PPU_IDR1_VPON_PPU_RESERVED_2_Msk                         (0x1UL << PPU_PPU_IDR1_VPON_PPU_RESERVED_2_Pos)

#define PPU_PPU_IDR1_VPON_PPU_STA_POLICY_PWR_IRQ_SPT_Pos             8U
#define PPU_PPU_IDR1_VPON_PPU_STA_POLICY_PWR_IRQ_SPT_Msk             (0x1UL << PPU_PPU_IDR1_VPON_PPU_STA_POLICY_PWR_IRQ_SPT_Pos)

#define PPU_PPU_IDR1_VPON_PPU_STA_POLICY_OP_IRQ_SPT_Pos              9U
#define PPU_PPU_IDR1_VPON_PPU_STA_POLICY_OP_IRQ_SPT_Msk              (0x1UL << PPU_PPU_IDR1_VPON_PPU_STA_POLICY_OP_IRQ_SPT_Pos)

#define PPU_PPU_IDR1_VPON_PPU_OP_ACTIVE_Pos                          10U
#define PPU_PPU_IDR1_VPON_PPU_OP_ACTIVE_Msk                          (0x1UL << PPU_PPU_IDR1_VPON_PPU_OP_ACTIVE_Pos)

#define PPU_PPU_IDR1_VPON_PPU_RESERVED_1_Pos                         11U
#define PPU_PPU_IDR1_VPON_PPU_RESERVED_1_Msk                         (0x1UL << PPU_PPU_IDR1_VPON_PPU_RESERVED_1_Pos)

#define PPU_PPU_IDR1_VPON_PPU_OFF_MEM_RET_TRANS_Pos                  12U
#define PPU_PPU_IDR1_VPON_PPU_OFF_MEM_RET_TRANS_Msk                  (0x1UL << PPU_PPU_IDR1_VPON_PPU_OFF_MEM_RET_TRANS_Pos)

#define PPU_PPU_IDR1_VPON_PPU_RESERVED_Pos                           13U
#define PPU_PPU_IDR1_VPON_PPU_RESERVED_Msk                           (0x7FFFFUL << PPU_PPU_IDR1_VPON_PPU_RESERVED_Pos)

/* 0x0FC8   0x4000_2fc8
    11:0    RO      IMPLEMENTER                 -.
    15:12   RO      REVISIONIMPLEMENTATION      -
    19:16   RO      VARIANTIMPLEMENTATION       -
    31:20   RO      PRODUCT_IDIMPLEMENTATION    -
 */
typedef union _PPU_PPU_IIDR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t IMPLEMENTER: 12;
        uint32_t REVISIONIMPLEMENTATION: 4;
        uint32_t VARIANTIMPLEMENTATION: 4;
        uint32_t PRODUCT_IDIMPLEMENTATION: 12;
    };
} PPU_PPU_IIDR_VPON_PPU_TYPE;

/*0x4000_2fc8 PPU_PPU_IIDR_VPON_PPU*/
#define PPU_PPU_IIDR_VPON_PPU_IMPLEMENTER_Pos                        0U
#define PPU_PPU_IIDR_VPON_PPU_IMPLEMENTER_Msk                        (0xFFFUL << PPU_PPU_IIDR_VPON_PPU_IMPLEMENTER_Pos)

#define PPU_PPU_IIDR_VPON_PPU_REVISIONIMPLEMENTATION_Pos             12U
#define PPU_PPU_IIDR_VPON_PPU_REVISIONIMPLEMENTATION_Msk             (0xFUL << PPU_PPU_IIDR_VPON_PPU_REVISIONIMPLEMENTATION_Pos)

#define PPU_PPU_IIDR_VPON_PPU_VARIANTIMPLEMENTATION_Pos              16U
#define PPU_PPU_IIDR_VPON_PPU_VARIANTIMPLEMENTATION_Msk              (0xFUL << PPU_PPU_IIDR_VPON_PPU_VARIANTIMPLEMENTATION_Pos)

#define PPU_PPU_IIDR_VPON_PPU_PRODUCT_IDIMPLEMENTATION_Pos           20U
#define PPU_PPU_IIDR_VPON_PPU_PRODUCT_IDIMPLEMENTATION_Msk           (0xFFFUL << PPU_PPU_IIDR_VPON_PPU_PRODUCT_IDIMPLEMENTATION_Pos)

/* 0x0FCC   0x4000_2fcc
    3:0     RO      ARCH_REV_MINOR              0x1
    7:4     RO      ARCH_REV_MAJOR              0x1
    31:8    RO      RESERVED                    0x0
 */
typedef union _PPU_PPU_AIDR_VPON_PPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ARCH_REV_MINOR: 4;
        uint32_t ARCH_REV_MAJOR: 4;
        uint32_t RESERVED: 24;
    };
} PPU_PPU_AIDR_VPON_PPU_TYPE;

/*0x4000_2fcc PPU_PPU_AIDR_VPON_PPU*/
#define PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MINOR_Pos                     0U
#define PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MINOR_Msk                     (0xFUL << PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MINOR_Pos)

#define PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MAJOR_Pos                     4U
#define PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MAJOR_Msk                     (0xFUL << PPU_PPU_AIDR_VPON_PPU_ARCH_REV_MAJOR_Pos)

#define PPU_PPU_AIDR_VPON_PPU_RESERVED_Pos                           8U
#define PPU_PPU_AIDR_VPON_PPU_RESERVED_Msk                           (0xFFFFFFUL << PPU_PPU_AIDR_VPON_PPU_RESERVED_Pos)

/* 0x0FD0   0x4000_2fd0
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_1_TYPE;

/*0x4000_2fd0 PPU_ID_REG_VPON_PPU_1*/
#define PPU_ID_REG_VPON_PPU_1_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_1_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_1_RESERVED_Pos)

/* 0x0FD4   0x4000_2fd4
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_2_TYPE;

/*0x4000_2fd4 PPU_ID_REG_VPON_PPU_2*/
#define PPU_ID_REG_VPON_PPU_2_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_2_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_2_RESERVED_Pos)

/* 0x0FD8   0x4000_2fd8
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_3_TYPE;

/*0x4000_2fd8 PPU_ID_REG_VPON_PPU_3*/
#define PPU_ID_REG_VPON_PPU_3_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_3_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_3_RESERVED_Pos)

/* 0x0FDC   0x4000_2fdc
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_4_TYPE;

/*0x4000_2fdc PPU_ID_REG_VPON_PPU_4*/
#define PPU_ID_REG_VPON_PPU_4_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_4_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_4_RESERVED_Pos)

/* 0x0FE0   0x4000_2fe0
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_5_TYPE;

/*0x4000_2fe0 PPU_ID_REG_VPON_PPU_5*/
#define PPU_ID_REG_VPON_PPU_5_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_5_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_5_RESERVED_Pos)

