rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/ppu_reg.h
/* 0x0FE4   0x4000_2fe4
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_6_TYPE;

/*0x4000_2fe4 PPU_ID_REG_VPON_PPU_6*/
#define PPU_ID_REG_VPON_PPU_6_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_6_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_6_RESERVED_Pos)

/* 0x0FE8   0x4000_2fe8
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_7_TYPE;

/*0x4000_2fe8 PPU_ID_REG_VPON_PPU_7*/
#define PPU_ID_REG_VPON_PPU_7_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_7_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_7_RESERVED_Pos)

/* 0x0FEC   0x4000_2fec
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_8_TYPE;

/*0x4000_2fec PPU_ID_REG_VPON_PPU_8*/
#define PPU_ID_REG_VPON_PPU_8_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_8_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_8_RESERVED_Pos)

/* 0x0FF0   0x4000_2ff0
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_9_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_9_TYPE;

/*0x4000_2ff0 PPU_ID_REG_VPON_PPU_9*/
#define PPU_ID_REG_VPON_PPU_9_RESERVED_Pos                           0U
#define PPU_ID_REG_VPON_PPU_9_RESERVED_Msk                           (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_9_RESERVED_Pos)

/* 0x0FF4   0x4000_2ff4
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_10_TYPE;

/*0x4000_2ff4 PPU_ID_REG_VPON_PPU_10*/
#define PPU_ID_REG_VPON_PPU_10_RESERVED_Pos                          0U
#define PPU_ID_REG_VPON_PPU_10_RESERVED_Msk                          (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_10_RESERVED_Pos)

/* 0x0FF8   0x4000_2ff8
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_11_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_11_TYPE;

/*0x4000_2ff8 PPU_ID_REG_VPON_PPU_11*/
#define PPU_ID_REG_VPON_PPU_11_RESERVED_Pos                          0U
#define PPU_ID_REG_VPON_PPU_11_RESERVED_Msk                          (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_11_RESERVED_Pos)

/* 0x0FFC   0x4000_2ffc
    31:0    RO      RESERVED                    32'h0
 */
typedef union _PPU_ID_REG_VPON_PPU_12_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PPU_ID_REG_VPON_PPU_12_TYPE;

/*0x4000_2ffc PPU_ID_REG_VPON_PPU_12*/
#define PPU_ID_REG_VPON_PPU_12_RESERVED_Pos                          0U
#define PPU_ID_REG_VPON_PPU_12_RESERVED_Msk                          (0xFFFFFFFFUL << PPU_ID_REG_VPON_PPU_12_RESERVED_Pos)

#define PPU_VPON_BASE 0x40002000
#define PPU_VCORE_BASE 0x4001B000

#define PPU_REG_READ(Base, Offset)\
    ((uint32_t)*((volatile uint32_t*)(Base+(Offset))))

#define PPU_REG_WRITE(Base, Offset, Value)\
    ((*((volatile uint32_t*)(Base + (Offset)))) = (Value))

#define PPU_REG_UPDATE(Base, Offset, Mask, Value) \
    do {\
        uint32_t temp;\
        temp = PPU_REG_READ(Base, Offset) & ~(Mask);\
        PPU_REG_WRITE(Base, Offset, (temp | ((Value) & (Mask))));\
    } while(0)

#define PPU_REG_READ_BITFIELD(Base, Offset, Bitfield)                   \
    (((Offset##_TYPE)PPU_REG_READ(Base, Offset)).Bitfield)

#define PPU_REG_WRITE_BITFIELD(Base, Offset, Bitfield, Value)           \
    do {                                                        \
        Offset##_TYPE temp = {.d32 = PPU_REG_READ(Base, Offset)};       \
        temp.Bitfield = Value;                                         \
        PPU_REG_WRITE(Base, Offset, temp.d32);                          \
    } while(0)

#endif //#define PPU_REG_H
